app/controllers/movies_controller.rb

  def index
    #@movies = Movie.order(*params[:order])
    @movies = Movie.where("rating in (?)", selected_ratings).order(params[:order])
---
SELECT "movies".* FROM "movies" WHERE (rating in ('G','PG','PG-13','R','NC-17')) ORDER BY release_date